Validation/run3/system/controlDict
FoamFile
{ 
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application       freezeFoam4;

startFrom         latestTime;
startTime         0;

stopAt            endTime;
endTime           20;

deltaT            1e-7;
maxDeltaT         1e-4;

writeControl      adjustableRunTime;
writeInterval     0.1;

purgeWrite        0;

writeFormat       ascii;
writePrecision    6;
writeCompression  off;

timeFormat        general;
timePrecision     6;

runTimeModifiable yes;
 
adjustTimeStep    yes;

maxCo             0.2;
maxAlphaCo        0.1;



